---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DepthDimensionNotExisted
source: html/fd565083-b1f2-57f0-d476-495a7c4b19d3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.DepthDimensionNotExisted Property

Multi-planar shape's depth dimension has been deleted. Please assign a new one to multi-planar depth.

## Syntax (C#)
```csharp
public static FailureDefinitionId DepthDimensionNotExisted { get; }
```